/******功能：显示高考排名榜单。并通过点击能查看相应的信息*****/
/******信息分为：基本介绍，录取分数，学校档次以及优势学科****/ 








#include"common.h"
#include"page21.h"


int p21(int*school)
{

	clrmous(MouseX,MouseY);
	delay(100);
	
	
    p21screen();
    	mouseinit();
    while(1)
    {
    	newmouse(&MouseX,&MouseY,&press);
    	if(mouse_press(50+20,100+40,300,100+40+30) == 1)
    	{
    		*school=1;
			return 9;
		}
		else if(mouse_press(50+20,100+40+30+25,300,100+40+30+30+25) == 1)
		{
			*school=2;
					return 9;
		 } 
		 else if(mouse_press(50+20,100+40+55+55,300,100+40+30+55+55) == 1)
		 {
		 	*school=3;
		 	return 9;
		 }
		 else if(mouse_press(50+20,100+40+55+55+55,300,100+40+30+55+55+55) == 1)
		 {
		 	*school=4;
		 	return 9;
		 }		 
		 else if(mouse_press(50+20,100+40+220,300,100+40+30+220) == 1)//鼠标在登录框中，且点击
		{   
		    *school=5;
			return 9;
			
		} 
		else if(mouse_press(50+20+270,100+40,300+270,100+40+30) == 1)//鼠标在登录框中，且点击
		{   
		    *school=6;
			return 9;
		}
			else if(mouse_press(50+20+270,100+40+55,300+270,100+40+30+55) == 1)//鼠标在登录框中，且点击
		{   
		    *school=7;
			return 9;
			
		} 
		else if(mouse_press(50+20+270,100+40+110,300+270,100+40+30+110) == 1)//鼠标在登录框中，且点击
		{   
		    *school=8;
			return 9;
			
		} 
			else if(mouse_press(50+20+270,100+40+165,300+270,100+40+30+165) == 1)//鼠标在登录框中，且点击
		{   
		    *school=9;
			return 9;
			
		} 
		 else if(mouse_press(50+20+270,100+40+220,300+270,100+40+30+220) == 1)//鼠标在登录框中，且点击
		{   
		    *school=10;
			return 9;
			
		}  
		else if(mouse_press(5,5,20,20) == 1)//鼠标在返回框中，且点击
				{
					return 7;
					
			}
		
		 
		
	}
}
			
 
		
		
		
		
		
		
		
		/*if(mouse_press(140,140,290,180)==1&&flag==1)
		{
			pbscreen();
			puthz(260,70,"基本介绍",24,30,LIGHTRED);
			puthz(75,145,"清华大学是中国著名高等学府，坐落于北京西北郊风景秀丽的清华园。是中国高层次人才培养和科学技术研究的重要基地之一。清华大学的前身是清华学堂，成立于一九一一年，当初是清政府建立的留美预备学校。一九四六年，清华大学迁回清华园原址复校，设有文、法、理、工、农等五个学院，微软十六个系。经过二一一工程建设和九八五计划的实施，清华大学在学科建设、人才培养、师资队伍、科学研究以及整体办学条件等方面均跃上了一个新的台阶。目前，清华大学设有十三个学院，五十四个系，已成为一所具有理学、工学、文学、艺术学、历史学、哲学、经济学、管理学、法学、教育学和医学等学科的综合性、研究型大学。",16,17,WHITE);
    
		}
		else if(mouse_press(140,300,290,340)==1&&flag==1)
		{
			pbscreen();
			puthz(260,70,"录取分数",24,30,LIGHTRED);
			puthz(75,145,"上海：不限组六百一十九分；物化组六百一十七分；物理组六百一十五分。北京：不限组六百八十四分；物化组六百八十三分；物理组六百八十一分。内蒙古：理科六百七十三分；文科六百五十三分。广西：理科六百七十九分；文科六百六十九分。江苏：物理组六百六十六分；物化组六百六十六分；历史组六百四十六分。河南：理科六百九十九分；文科六百七十七分。山西：理科六百七十二分；文科六百六十六分。浙江：通用基础类七百一十五分；物理基础类六百九十五分；临床医学类六百九十五分。湖南：物理组六百八十一分；物化组六百八十六分；历史组六百五十七分。海南：不限组八百七十七分；物理组八百三十八分；物化组八百三十六分",16,17,WHITE);

		}
		else if(mouse_press(140,300,290,340)==1&&flag==1)
		{
			pbscreen();
			puthz(260,70,"学校档次",24,30,LIGHTRED);
			puthz(75,145,"经过多年的建设，清华大学已基本形成了综合性的学科布局。目前，清华大学共有本科专业六十六个，第二学位专业七个。截至二零一一年三月，清华大学共有博士学位授权点两百五十三个、硕士学位授权点二百七十一个，其中一级学科博士、硕士学位授权点四十五个，一级学科硕士学位授权点七个，二级学科博士、硕士学位授权点两百五十三个，二级学科硕士学位授予权点十八个，分布在哲学、经济学、法学、教育学、文学、历史学、理学、工学、医学、管理学、艺术学等十一个学科门类。",16,17,WHITE);
    
		}
		else if(mouse_press(350,300,500,340)==1&&flag==1)
		{
			pbscreen();
			puthz(260,70,"优势学科",24,30,LIGHTRED);
			puthz(75,145,"水利水电工程专业、车辆工程专业、能源与动力工程专业和核工程与核技术专业、建筑学、土木工程、机械工程、自动化、机械设计制造及其自动化、测控技术与仪器等，计算机科学与技术。",24,25,WHITE);

		}
		else if(mouse_press(140,140,290,180)==1&&flag==2)
		{
			pbscreen();
			puthz(260,70,"基本介绍",24,30,LIGHTRED);
			puthz(75,145,"北京大学创办于一八九八年，初名京师大学堂，是中国第一所国立大学，也是中国近代正式设立的第一所大学，其成立标志着中国近代高等教育的开端。自建校以来，一直享有崇高的名声和地位是中国最高学府，同时也是中国综合实力第一的大学，理科、文科、社会科学、新型工科和医科都是它的强项。按照国家重点学科，北大的理科、文科、医科实力均为全国第一。北京大学始终保持的爱国进步民主科学的传统，百余年来，北大校园中人文渊薮，英才辈出，为民族复兴、国家强盛做出了不可替代的贡献。据统计，北大校友中，已有五人获得国家最高科学技术奖，十二人人成为两弹一星的元勋，近五百人当选两院院士",16,17,WHITE);
	
		}
		
		
		
		
		
		
		
	}*/
	
	
	



void p21screen(void)
{
	int v[16] ={5,13,15,5,15,8,20,8,20,17,15,17,15,20,5,13};
	cleardevice();
	setbkcolor(BLUE);
	setcolor(WHITE);
	setlinestyle(0,0,3);
	rectangle(30,30,610,450);
	setfillstyle(1,LIGHTBLUE);
	
	rectangle(0,0,25,25);
	
	fillpoly(8,v);
	bar(30,30,610,450);
	setlinestyle(0,0,1);
	setfillstyle(1,DARKGRAY);
	bar(50,40,200,80);
	puthz(70,50,"高校排名榜",24,25,RED);
	bar(240,40,590,80);
	circle(260,55,10);
	setfillstyle(1,WHITE);
	floodfill(260,55,WHITE);
	bar(257,55,263,70);
	setcolor(BLACK);
	circle(260,55,8);
	setcolor(RED);
	rectangle(50,100,590,430);
	setfillstyle(1,WHITE);
	bar(52,102,588,428);
	setcolor(RED);
	setlinestyle(0,0,3);
	line(320,100,320,430);
	setfillstyle(1,LIGHTBLUE);
	
	setcolor(RED);
	bar(50+20,100+40,300,100+40+30);
	puthz(50+80+20+10,100+40+5,"清华大学",24,30,YELLOW);
	settextstyle(0,0,2);
	outtextxy(50+20+10,100+40+8,"No.1");
	setcolor(LIGHTBLUE);
	rectangle(50+20,100+40,300,100+40+30);
	
	setcolor(RED);
	bar(50+20,100+40+30+25,300,100+40+30+30+25);
	puthz(50+80+20+10,100+40+5+55,"北京大学",24,30,YELLOW);
	settextstyle(0,0,2);
	outtextxy(50+20+10,100+40+8+55,"No.2");
	
	setcolor(RED);
	bar(50+20,100+40+55+55,300,100+40+30+55+55);
	puthz(50+80+20+10,100+40+5+110,"浙江大学",24,30,YELLOW);
	settextstyle(0,0,2);
	outtextxy(50+20+10,100+40+8+110,"No.3");
	 
	setcolor(RED);
	bar(50+20,100+40+165,300,100+40+30+165);
	puthz(50+80+20+10,100+40+5+165,"上海交通大学",16,21,YELLOW);
	settextstyle(0,0,2);
	outtextxy(50+20+10,100+40+8+165,"No.4");
	
	setcolor(RED);
	bar(50+20,100+40+220,300,100+40+30+220);
	puthz(50+80+20+10,100+40+5+220,"复旦大学",24,30,YELLOW);
	settextstyle(0,0,2);
	outtextxy(50+20+10,100+40+8+220,"No.5");
	
	/**********************/
	
	setcolor(RED);
	bar(50+20+270,100+40,300+270,100+40+30);
	puthz(50+80+20+10+270,100+40+5,"南京大学",24,30,YELLOW);
	settextstyle(0,0,2);
	outtextxy(50+20+10+270,100+40+8,"No.6");
	
	
	setcolor(RED);
	bar(50+20+270,100+40+55,300+270,100+40+30+55);
	puthz(40+80+20+10+270,100+40+5+55,"中国科学技术大学",16,18,YELLOW);
	settextstyle(0,0,2);
	outtextxy(50+20+10+270,100+40+8+55,"No.7");
	
	
	setcolor(RED);
	bar(50+20+270,100+40+110,300+270,100+40+30+110);
	puthz(50+80+20+10+270,100+40+5+110,"华中科技大学",16,21,YELLOW);
	settextstyle(0,0,2);
	outtextxy(50+20+10+270,100+40+8+110,"No.8");
	
	setcolor(RED);
	bar(50+20+270,100+40+165,300+270,100+40+30+165);
	puthz(50+80+20+10+270,100+40+5+165,"武汉大学",24,30,YELLOW);
	settextstyle(0,0,2);
	outtextxy(50+20+10+270,100+40+8+165,"No.9");
	
	setcolor(RED);
	bar(50+20+270,100+40+220,300+270,100+40+30+220);
	puthz(50+80+20+10+270,100+40+5+220,"西安交通大学",16,21,YELLOW);
	settextstyle(0,0,2);
	outtextxy(50+20+10+270,100+40+8+220,"No.10");
	
	
}
