#include"common.h"
#include"question.h"

int question(int *flag6,int *flag7,int *flag8,int *flag9,int *flag10,int *flag11)
{
	int p=0;
			
	clrmous(MouseX,MouseY);
	delay(100);
//	questionbk();
	mouseinit();
	while(1)
	{
		newmouse(&MouseX,&MouseY,&press);
/*		if(user->choose>=1&&user->choose<=3)
		{*/
			if (mouse_press(130-80,100,145-80,100+15) == 1)
			{
				clrmous(MouseX,MouseY);
				setfillstyle(1,	WHITE);
				bar(130-80,100+17,145-80,100+17+15);
				setfillstyle(1,RED);
				bar(130-80,100,145-80,100+15);
				*flag6=1;
			}
			else if (mouse_press(130-80,100+17,145-80,100+17+15) == 1)
			{
				clrmous(MouseX,MouseY);
				setfillstyle(1,	WHITE);
				bar(130-80,100,145-80,100+15);
				setfillstyle(1,RED);
				bar(130-80,100+17,145-80,100+17+15);
				*flag6=2;
			}			
			
			
			
			if (mouse_press(130-80,80+20*2+17*2,145-80,80+20*2+17*2+15) == 1)
			{
				clrmous(MouseX,MouseY);
				setfillstyle(1,	WHITE);
				bar(130-80,80+20*2+17*3,145-80,80+20*2+17*3+15);
				setfillstyle(1,RED);
				bar(130-80,80+20*2+17*2,145-80,80+20*2+17*2+15);
				*flag7=1;
			}
			else if (mouse_press(130-80,80+20*2+17*3,145-80,80+20*2+17*3+15) == 1)
			{
				clrmous(MouseX,MouseY);
				setfillstyle(1,	WHITE);
				bar(130-80,80+20*2+17*2,145-80,80+20*2+17*2+15);
				setfillstyle(1,RED);
				bar(130-80,80+20*2+17*3,145-80,80+20*2+17*3+15);
				*flag7=2;
			}						
			
			
			
			
			if (mouse_press(130-80,80+20*3+17*4,145-80,80+20*3+17*4+15) == 1)
			{
				clrmous(MouseX,MouseY);
				setfillstyle(1,	WHITE);
				bar(130-80,80+20*3+17*5,145-80,80+20*3+17*5+15);
				setfillstyle(1,RED);
				bar(130-80,80+20*3+17*4,145-80,80+20*3+17*4+15);
				*flag8=1;
			}
			else if (mouse_press(130-80,80+20*3+17*5,145-80,80+20*3+17*5+15) == 1)
			{
				clrmous(MouseX,MouseY);
				setfillstyle(1,	WHITE);
				bar(130-80,80+20*3+17*4,145-80,80+20*3+17*4+15);
				setfillstyle(1,RED);
				bar(130-80,80+20*3+17*5,145-80,80+20*3+17*5+15);
				*flag8=2;
			}			
			
			
			
			if (mouse_press(130-80,80+20*4+17*6,145,80+20*4+17*6+15) == 1)
			{
				clrmous(MouseX,MouseY);
				setfillstyle(1,	WHITE);
				bar(130-80,80+20*4+17*7,145-80,80+20*4+17*7+15);
				bar(130-80,80+20*4+17*8,145-80,80+20*4+17*8+15);
				setfillstyle(1,RED);
				bar(130-80,80+20*4+17*6,145-80,80+20*4+17*6+15);
				*flag9=1;
			}
			else if (mouse_press(130-80,80+20*4+17*7,145-80,80+20*4+17*7+15) == 1)
			{
				clrmous(MouseX,MouseY);
				setfillstyle(1,	WHITE);
				bar(130-80,80+20*4+17*6,145-80,80+20*4+17*6+15);
				bar(130-80,80+20*4+17*8,145-80,80+20*4+17*8+15);
				setfillstyle(1,RED);
				bar(130-80,80+20*4+17*7,145-80,80+20*4+17*7+15);
				*flag9=2;
			}						
			else if (mouse_press(130-80,80+20*4+17*8,145-80,80+20*4+17*8+15) == 1)
			{
				clrmous(MouseX,MouseY);
				setfillstyle(1,	WHITE);
				bar(130-80,80+20*4+17*6,145-80,80+20*4+17*6+15);
				bar(130-80,80+20*4+17*7,145-80,80+20*4+17*7+15);
				setfillstyle(1,RED);
				bar(130-80,80+20*4+17*8,145-80,80+20*4+17*8+15);
				*flag9=3;
			}									
			
			
			
			
			
			if (mouse_press(130-80,80+20*5+17*9,145-80,80+20*5+17*9+15) == 1)
			{
				clrmous(MouseX,MouseY);
				setfillstyle(1,	WHITE);
				bar(130-80,80+20*5+17*10,145-80,80+20*5+17*10+15);
				bar(130-80,80+20*5+17*11,145-80,80+20*5+17*11+15);
				bar(130-80,80+20*5+17*12,145-80,80+20*5+17*12+15);
				setfillstyle(1,RED);
				bar(130-80,80+20*5+17*9,145-80,80+20*5+17*9+15);
				*flag10=1;
			}
			else if (mouse_press(130-80,80+20*5+17*10,145-80,80+20*5+17*10+15) == 1)
			{
				clrmous(MouseX,MouseY);
				setfillstyle(1,	WHITE);
				bar(130-80,80+20*5+17*9,145-80,80+20*5+17*9+15);
				bar(130-80,80+20*5+17*11,145-80,80+20*5+17*11+15);
				bar(130-80,80+20*5+17*12,145-80,80+20*5+17*12+15);
				setfillstyle(1,RED);
				bar(130-80,80+20*5+17*10,145-80,80+20*5+17*10+15);
				*flag10=2;
			}						
			else if (mouse_press(130-80,80+20*5+17*11,145-80,80+20*5+17*11+15) == 1)
			{
				clrmous(MouseX,MouseY);
				setfillstyle(1,	WHITE);
				bar(130-80,80+20*5+17*9,145-80,80+20*5+17*9+15);
				bar(130-80,80+20*5+17*10,145-80,80+20*5+17*10+15);
				bar(130-80,80+20*5+17*12,145-80,80+20*5+17*12+15);
				setfillstyle(1,RED);
				bar(130-80,80+20*5+17*11,145-80,80+20*5+17*11+15);
				*flag10=3;
			}								
			else if (mouse_press(130-80,80+20*5+17*12,145-80,80+20*5+17*12+15) == 1)
			{
				
				clrmous(MouseX,MouseY);
				setfillstyle(1,	WHITE);
				bar(130-80,80+20*5+17*9,145-80,80+20*5+17*9+15);
				bar(130-80,80+20*5+17*10,145-80,80+20*5+17*10+15);
				bar(130-80,80+20*5+17*11,145-80,80+20*5+17*11+15);
				setfillstyle(1,RED);
				bar(130-80,80+20*5+17*12,145-80,80+20*5+17*12+15);
				*flag10=4;
			}									
			
			
			
			
			if (mouse_press(286,80+20*4+17*6,286+15,80+20*4+17*6+15) == 1)
			{
				clrmous(MouseX,MouseY);
				setfillstyle(1,	WHITE);
				bar(286,80+20*4+17*7,286+15,80+20*4+17*7+15);
				setfillstyle(1,RED);
				bar(286,80+20*4+17*6,286+15,80+20*4+17*6+15);
				*flag11=1;
			}
			else if (mouse_press(286,80+20*4+17*7,286+15,80+20*4+17*7+15) == 1)
			{
				clrmous(MouseX,MouseY);
				setfillstyle(1,	WHITE);
				bar(286,80+20*4+17*6,286+15,80+20*4+17*6+15);
				setfillstyle(1,RED);
				bar(286,80+20*4+17*7,286+15,80+20*4+17*7+15);
				*flag11=2;
			}						
			
			
			
			if(mouse_press(251,410,305,438) == 1)
			{
				
				if(p==0&&(*flag6==0||*flag7==0||*flag8==0||*flag9==0||*flag10==0||*flag11==0))
				{
					p=1;
					puthz(130-80,80+20*5+17*13+10,"问题未全部答完！",24,24,YELLOW);
				}			
				
				else if(*flag6!=0&&*flag7!=0&&*flag8!=0&&*flag9!=0&&*flag10!=0&&*flag11!=0)
				{
					return 20;	
				}
				
			}
			

			
			else if(mouse_press(335,410,389,438) == 1)
			{
					*flag6=0;
					*flag7=0;
					*flag8=0;
					*flag9=0;
					*flag10=0;
					*flag11=0;				
				return 2;
			}			
			
						
			
		}	
		
	

}


void questionbk()
{
//	int gd=VGA,gm=VGAHI;
//	initgraph(&gd,&gm,"C:\\borland c\\bgi");
	cleardevice();
	setbkcolor(BLACK);
	setfillstyle(1,BLUE);
	bar(10,10,640-10,480-10);
	setcolor(BROWN);
	setlinestyle(0,0,3);
	rectangle(10,10,640-10,480-10);
	
	puthz(320-34*3,20+20,"专业测试",32,34,WHITE);	
	
	
	puthz(100-80,80,"您更擅长解决实际问题还是研究理论？",16,16,WHITE);
	setfillstyle(1,WHITE);
	bar(130-80,100,145-80,100+15);
	puthz(148-80,100,"解决实际问题",16,16,WHITE);  //工科
	bar(130-80,100+17,145-80,100+17+15);
	puthz(148-80,117,"研究理论",16,16,WHITE);  //数学或物理
	
	
	
	puthz(100-80,80+20+17*2,"您更喜欢救死扶伤的医科还是科技强国的理工科？",16,16,WHITE);
	setfillstyle(1,WHITE);
	bar(130-80,80+20*2+17*2,145-80,80+20*2+17*2+15);
	puthz(148-80,80+20*2+17*2,"妙手回春",16,16,WHITE);  //医科
	bar(130-80,80+20*2+17*3,145-80,80+20*2+17*3+15);
	puthz(148-80,80+20*2+17*3,"大国工匠",16,16,WHITE);  //工科
	
	
	
	puthz(100-80,80+20*2+17*4,"您更倾向于计算机等软件方面还是硬件操作？",16,16,WHITE);
	setfillstyle(1,WHITE);
	bar(130-80,80+20*3+17*4,145-80,80+20*3+17*4+15);
	puthz(148-80,80+20*3+17*4,"软件",16,16,WHITE);  //计算机科学
	bar(130-80,80+20*3+17*5,145-80,80+20*3+17*5+15);
	puthz(148-80,80+20*3+17*5,"硬件",16,16,WHITE);	 //自动化（若高中物理）人工智能（若高中数学）
	
	
	
	puthz(100-80,80+20*3+17*6,"您的以下哪种能力最强？",16,16,WHITE);
	setfillstyle(1,WHITE);
	bar(130-80,80+20*4+17*6,145-80,80+20*4+17*6+15);
	puthz(148-80,80+20*4+17*6,"抽象思维",16,16,WHITE);  //电气
	bar(130-80,80+20*4+17*7,145-80,80+20*4+17*7+15);
	puthz(148-80,80+20*4+17*7,"空间想象",16,16,WHITE);  //机械
	bar(130-80,80+20*4+17*8,145-80,80+20*4+17*8+15);
	puthz(148-80,80+20*4+17*8,"逻辑推导",16,16,WHITE);  //人工智能，计算机科学，自动化		
	
	
	
	puthz(100-80,80+20*4+17*9,"在高中时，您最喜欢或擅长的科目是？",16,16,WHITE);
	setfillstyle(1,WHITE);
	bar(130-80,80+20*5+17*9,145-80,80+20*5+17*9+15);
	puthz(148-80,80+20*5+17*9,"数学",16,16,WHITE);   
	bar(130-80,80+20*5+17*10,145-80,80+20*5+17*10+15);
	puthz(148-80,80+20*5+17*10,"物理",16,16,WHITE);		
	bar(130-80,80+20*5+17*11,145-80,80+20*5+17*11+15);
	puthz(148-80,80+20*5+17*11,"化学",16,16,WHITE);		
	bar(130-80,80+20*5+17*12,145-80,80+20*5+17*12+15);
	puthz(148-80,80+20*5+17*12,"生物",16,16,WHITE);
	
	
	puthz(256,80+20*3+17*6,"您更擅长创新思维还是较为保守？",16,16,WHITE);
	setfillstyle(1,WHITE);
	bar(286,80+20*4+17*6,286+15,80+20*4+17*6+15);
	puthz(286+18,80+20*4+17*6,"创新",16,16,WHITE);   	
	bar(286,80+20*4+17*7,286+15,80+20*4+17*7+15);
	puthz(286+18,80+20*4+17*7,"保守",16,16,WHITE);   	
	
	
	setcolor(BROWN);
	bar(251,410,305,438);
	rectangle(251,410,305,438);
	bar(335,410,389,438);
	rectangle(335,410,389,438);
	puthz(253,410,"确定",24,26,RED);
	puthz(337,410,"退出",24,26,RED);				
}
